app/Controllers/Auth.php

SELECT *
FROM `mahasiswa`
WHERE `nim` = '2510514022'
AND `password` = 'pass921'
 LIMIT 1
---
    public function loginProcess()
    {
        $model = new MahasiswaModel();
        $nim = $this->request->getPost('nim');
        $password = $this->request->getPost('password');
        $remember = $this->request->getPost('remember');

        $user = $model->where([
            'nim' => $nim,
            'password' => $password
        ])->first();