app/Controllers/Dashboard.php

SELECT *
FROM `notifikasi`
WHERE `id_mahasiswa` = '20'
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $eventModel = new EventModel();
        $pendaftaranModel = new PendaftaranModel();
        $notifModel = new NotifikasiModel();

        // beberapa ringkasan sederhana
        $data = [
            'count_events' => count($eventModel->findAll()),
            'count_pendaftaran' => count($pendaftaranModel->where('id_mahasiswa', session()->get('user')['id_mahasiswa'])->findAll()),
            'notifikasi' => $notifModel->where('id_mahasiswa', session()->get('user')['id_mahasiswa'])->orderBy('tanggal', 'DESC')->findAll()