app/Controllers/EventController.php

    public function index()
    {
        $data['event'] = $this->eventModel->orderBy('deadline_pendaftaran','ASC')->findAll();
---
SELECT *
FROM `event`
ORDER BY `deadline_pendaftaran` ASC